[
  "I once convinced my younger brother that chocolate milk came from brown cows. He believed it for two years. My parents believed I needed a hobby.",
  "Mom used to bribe me with cookies to practice piano. I never learned piano, but I did gain ten pounds.",
  "My dad said, “You can be anything.” I chose class clown. He did not mean *that*.",
  "We had a family dog named Comet. He hated baths and loved my socks. We bonded over our shared disdain for hygiene.",
  "I tried to run away from home once. Packed two granola bars and a Game Boy. Made it as far as the mailbox.",
  "I waved back at someone who wasn’t waving at me. Then I tried to play it off like I was stretching. It only made it worse.",
  "My pants once ripped mid-interview. I tried to finish strong, legs clenched like a Cirque du Soleil performer.",
  "I accidentally liked my ex’s Instagram post from 2014 at 3 a.m. No recovery. Just shame.",
  "I once laughed so hard on a date I snorted water out my nose. She called it endearing. She also never texted back.",
  "Got recognized at the airport. Felt cool until they said, “Wait, aren’t you that guy from the toothpaste ad?”",
  "My first real acting gig was a commercial for toenail fungus cream. My mom taped it. For blackmail.",
  "I once forgot my only line on stage and improvised an entire monologue. Critics called it bold. It was panic.",
  "I got rejected for a role because I was “too sarcastic for the villain.” I took it as a weird compliment.",
  "When I finally made it onto a big set, I tripped over a camera cable and apologized to the light stand.",
  "My biggest fear isn’t failure. It’s someone reading my old audition tapes out loud.",
  "Our first kiss happened during a rainstorm. I made a joke about how cliché it was. She kissed me anyway.",
  "I once cooked her a three-course meal. Burned the appetizer, undercooked the entrée, forgot dessert. She still said it was perfect.",
  "She used to fall asleep mid-movie on the couch. I’d pretend I wasn’t watching her more than the screen.",
  "The first time I told her I loved her, I panicked and followed it up with '...like, emotionally.' She laughed. Thank God.",
  "We fought about toothpaste once—cap on or off. I moved out for a day just to make a point. Came back with flowers and the cap glued shut.",
  "I once turned down a role because I didn’t think I was ready. Then watched someone else nail it. Regret tastes like humility.",
  "I tried therapy once. Spent most of the session making jokes. Left realizing I was terrified of hearing myself talk seriously.",
  "I missed my best friend’s wedding because I overslept on the wrong flight. Still haven’t fully forgiven myself.",
  "There was a girl I loved who said she didn’t feel like she knew the “real me.” I realized I didn’t either.",
  "I ghosted someone because I couldn’t explain how sad I was feeling. Still think about that sometimes."
]